#include <stdlib.h>
#include <conio.h>
#include <windows.h>
#include <iostream>


using namespace std;

float main()
{
	setlocale(0, "RU");
	cout << "ggg";

	float Ï1_1=1315, Ï1_2=1424, Ï1_3=1231;
	float Ï2_1=251, Ï2_2=335, Ï2_3=418;
	float Ï3_1=3408, Ï3_2=3115, Ï3_3=3558;
	float Ï4_1=99, Ï4_2=18, Ï4_3=93;
	float Ï5_1=78, Ï5_2=90, Ï5_3=76;
	float Ï6_1=12, Ï6_2=12, Ï6_3=12;
	float Ï7_1=217, Ï7_2=58, Ï7_3=103;
	float Ï8_1=72, Ï8_2=120, Ï8_3=117;
	float Ï9=8161242;
	float Ï10=5940843;
	float Ï11=5314304;
	float Ï12=21162018;
	float Ï13=2539442;
	float Ï14=106286089;
	float Íòç=10;
	float Íñîö=30;
	float Íïðèá = 20;

	float Íïð = 0;

	

	float Çì1 = Ï2_1*(1+Íòç / 100);
	float Çì2 = Ï2_2*(1+Íòç / 100);
	float Çì3 = Ï2_3*(1+Íòç / 100);

	float Çï1 = Ï3_1*(1 + Íòç / 100);
	float Çï2 = Ï3_2*(1 + Íòç / 100);
	float Çï3 = Ï3_3*(1 + Íòç / 100);

	float Çîñí1 = Ï4_1*Ï5_1*(1 - Íïð / 100);
	float Çîñí2 = Ï4_2*Ï5_2*(1 - Íïð / 100);
	float Çîñí3 = Ï4_3*Ï5_3*(1 - Íïð / 100);

	float Çäîï1 = Çîñí1 * Ï6_1 / 100;
	float Çäîï2 = Çîñí2 * Ï6_2 / 100;
	float Çäîï3 = Çîñí3 * Ï6_3 / 100;

	float Çñîö1 = (Çîñí1 + Çäîï1) * Íñîö / 100;
	float Çñîö2 = (Çîñí2 + Çäîï2) * Íñîö / 100;
	float Çñîö3 = (Çîñí3 + Çäîï3) * Íñîö / 100;

	float Çýî1 = Ï7_1*Ï8_1;
	float Çýî2 = Ï7_2*Ï8_2;
	float Çýî3 = Ï7_3*Ï8_3;

	float Çïð1 = Çì1 + Çï1 + Çîñí1 + Çäîï1 + Çñîö1 + Çýî1;
	float Çïð2 = Çì2 + Çï2 + Çîñí2 + Çäîï2 + Çñîö2 + Çýî2;
	float Çïð3 = Çì3 + Çï3 + Çîñí3 + Çäîï3 + Çñîö3 + Çýî3;

	cout << "Çïð1=" << Çïð1 << "\n";
	cout << "Çïð2=" << Çïð2 << "\n";
	cout << "Çïð3=" << Çïð3 << "\n";

	float Çãïð1 = Çïð1*Ï1_1;
	float Çãïð2 = Çïð2*Ï1_2;
	float Çãïð3 = Çïð3*Ï1_3;

	float Íîïð_é = Ï9 / (Ï12 + Ï13)*100;
	float Çîïð1_é = (Çîñí1 + Çäîï1)*Íîïð_é / 100;
	float Çîïð2_é = (Çîñí2 + Çäîï2)*Íîïð_é / 100;
	float Çîïð3_é = (Çîñí3 + Çäîï3)*Íîïð_é / 100;

	float Sïð = Çãïð1 + Çãïð2 + Çãïð3;
	float Íîïð_éé = Ï9 / (Sïð)*100;
	float Çîïð1_éé = (Çïð1)*Íîïð_éé / 100;
	float Çîïð2_éé = (Çïð2)*Íîïð_éé / 100;
	float Çîïð3_éé = (Çïð3)*Íîïð_éé / 100;

	float Íîõ_é = Ï10 / (Ï12 + Ï13) * 100;
	float Çîõ1_é = (Çîñí1 + Çäîï1) * Íîõ_é / 100;
	float Çîõ2_é = (Çîñí2 + Çäîï2) * Íîõ_é / 100;
	float Çîõ3_é = (Çîñí3 + Çäîï3) * Íîõ_é / 100;

	float Íîõ_éé = Ï10 /(Sïð) * 100;
	float Çîõ1_éé = (Çïð1 ) * Íîõ_éé / 100;
	float Çîõ2_éé = (Çïð2 ) * Íîõ_éé / 100;
	float Çîõ3_éé = (Çïð3 ) * Íîõ_éé / 100;



	float Íêîì = Ï11 / Ï14*100;


	float Ñö1_é = Çïð1 + Çîïð1_é;
	float Ñö2_é = Çïð2 + Çîïð2_é;
	float Ñö3_é = Çïð3 + Çîïð3_é;

	float Ñö1_éé = Çïð1 + Çîïð1_éé;
	float Ñö2_éé = Çïð2 + Çîïð2_éé;
	float Ñö3_éé = Çïð3 + Çîïð3_éé;

	
	float Ñïð1_é = Ñö1_é + Çîõ1_é;
	float Ñïð2_é = Ñö2_é + Çîõ2_é;
	float Ñïð3_é = Ñö3_é + Çîõ3_é;

	float Ñïð1_éé = Ñö1_éé + Çîõ1_éé;
	float Ñïð2_éé = Ñö2_éé + Çîõ2_éé;
	float Ñïð3_éé = Ñö3_éé + Çîõ3_éé;


	float Çêîì1_é = Ñïð1_é*Íêîì / 100;
	float Çêîì2_é = Ñïð2_é*Íêîì / 100;
	float Çêîì3_é = Ñïð3_é*Íêîì / 100;

	float Çêîì1_éé = Ñïð1_éé*Íêîì / 100;
	float Çêîì2_éé = Ñïð2_éé*Íêîì / 100;
	float Çêîì3_éé = Ñïð3_éé*Íêîì / 100;


	float Ñï1_é = Ñïð1_é + Çêîì1_é;
	float Ñï2_é = Ñïð2_é + Çêîì2_é;
	float Ñï3_é = Ñïð3_é + Çêîì3_é;

	float Ñï1_éé = Ñïð1_éé + Çêîì1_éé;
	float Ñï2_éé = Ñïð2_éé + Çêîì2_éé;
	float Ñï3_éé = Ñïð3_éé + Çêîì3_éé;


	
	
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	//                                   ×.2
	//////////////////////////////////////////////////////////////////////////////







	float Ï1_é = Ñï1_é * Íïðèá / 100;
	float Ï2_é = Ñï2_é * Íïðèá / 100;
	float Ï3_é = Ñï3_é * Íïðèá / 100;

	float Ï1_éé = Ñï1_éé * Íïðèá / 100;
	float Ï2_éé = Ñï2_éé * Íïðèá / 100;
	float Ï3_éé = Ñï3_éé * Íïðèá / 100;


	float P1_é = Ñï1_é + Ï1_é;
	float P2_é = Ñï2_é + Ï2_é;
	float P3_é = Ñï3_é + Ï3_é;

	float P1_éé = Ñï1_éé + Ï1_éé;
	float P2_éé = Ñï2_éé + Ï2_éé;
	float P3_éé = Ñï3_éé + Ï3_éé;


	float Â1_é = Ï1_1*P1_é;
	float Â2_é = Ï1_2*P2_é;
	float Â3_é = Ï1_3*P3_é;

	float Â1_éé = Ï1_1*P1_éé;
	float Â2_éé = Ï1_2*P2_éé;
	float Â3_éé = Ï1_3*P3_éé;


	float FC1_é = (Çîïð1_é + Çîõ1_é + Çêîì1_é)*Ï1_1;
	float FC2_é = (Çîïð2_é + Çîõ2_é + Çêîì2_é)*Ï1_2;
	float FC3_é = (Çîïð3_é + Çîõ3_é + Çêîì3_é)*Ï1_3;

	float FC1_éé = (Çîïð1_éé + Çîõ1_éé + Çêîì1_éé)*Ï1_1;
	float FC2_éé = (Çîïð2_éé + Çîõ2_éé + Çêîì2_éé)*Ï1_2;
	float FC3_éé = (Çîïð3_éé + Çîõ3_éé + Çêîì3_éé)*Ï1_3;

	float Ðåíòïðîä1_é = Ï1_é / Ñï1_é * 100;
	float Ðåíòïðîä2_é = Ï2_é / Ñï2_é * 100;
	float Ðåíòïðîä3_é = Ï3_é / Ñï3_é * 100;

	float Ðåíòïðîä1_éé = Ï1_éé / Ñï1_éé * 100;
	float Ðåíòïðîä2_éé = Ï2_éé / Ñï2_éé * 100;
	float Ðåíòïðîä3_éé = Ï3_éé / Ñï3_éé * 100;


	//Çïð1 Cï1_é 
	/** /
	ñò=FC1_é+Çïð1*øò
	ñò=Â1_é/Ï1_1*øò
	FC1_é+Çïð1*øò=Â1_é/Ï1_1*øò;
	FC1_é+Çïð1*øò-Â1_é/Ï1_1*øò=0;
	FC1_é+(Çïð1-Â1_é/Ï1_1)*øò=0;
	øò=-FC1_é/(Çïð1-Â1_é/Ï1_1);
	/**/

	float øò1_é = -FC1_é / (Çïð1 - Â1_é / Ï1_1);
	float øò2_é = -FC2_é / (Çïð2 - Â2_é / Ï1_2);
	float øò3_é = -FC3_é / (Çïð3 - Â3_é / Ï1_3);

	float øò1_éé = -FC1_éé / (Çïð1 - Â1_éé / Ï1_1);
	float øò2_éé = -FC2_éé / (Çïð2 - Â2_éé / Ï1_2);
	float øò3_éé = -FC3_éé / (Çïð3 - Â3_éé / Ï1_3);



		
	system("pause");
}















